Revit 2024 API
FabricSheet.IsValidHost Method
Overload List
Name | Description
IsValidHost(Element)
 Checks whether an element is a valid host for fabric sheet.
IsValidHost(Document, ElementId)
 Checks whether an element is a valid host for fabric sheet.
See Also
FabricSheet Class
FabricSheet Members
Autodesk.Revit.DB.Structure Namespace